package com.example.hrdepartamentv2

data class Person(
    var name: String,
    var surname: String,
    var jobTitle: String,
    var salary: Int,
    var image: Int = R.drawable.ic_launcher_foreground
) {
    companion object {
        val persons = listOf<Person>(
            Person("Анна", "Кузнецова", "Врач", 80000),
            Person("Елена", "Петрова", "Инженер", 85000),
            Person("Максим", "Семенов", "Программист", 90000),
            Person("Олег", "Тихонов", "Учитель", 57000),
            Person("Наталья", "Кузьмин", "Менеджер", 55000),
            Person("Алексей", "Иванов", "Врач", 75000),
            Person("Валентина", "Сидорова", "Дизайнер", 78000),
            Person("Дмитрий", "Леванов", "Маркетолог", 80000),
            Person("Светлана", "Морозова", "Учитель", 60000),
            Person("Иван", "Иванов", "Инженер", 60000),
            Person("Петр", "Петров", "Программист", 65000),
            Person("Сергей", "Сидоров", "Аналитик", 70000),
            Person("Кирилл", "Алексеев", "Дизайнер", 72000),
            Person("Мария", "Соловьева", "Маркетолог", 74000),
            Person("Татьяна", "Захарова", "Инженер", 76000),
            Person("Роман", "Ковалев", "Учитель", 72000),
            Person("Анастасия", "Григорьева", "Юрист", 74000),
            Person("Евгений", "Кузьмин", "Аналитик", 68000),
            Person("Полина", "Яковлева", "Менеджер", 60000),
            Person("Артем", "Сергеев", "Врач", 62000),
            Person("Елизавета", "Фролова", "Юрист", 64000),
            Person("Александр", "Васильев", "Дизайнер", 75000),
            Person("Галина", "Смирнова", "Программист", 73000),
            Person("Данил", "Борисов", "Инженер", 72000),
            Person("Вероника", "Луговская", "Программист", 70000)
        )
    }
}